tests/fixtures/wallet_index.json

{
  "wallets": [
    {
      "lago_id": "b7ab2926-1de8-4428-9bcd-779314ac129b",
      "lago_customer_id": "12345",
      "external_customer_id": "external-12345",
      "status": "active",
      "currency": "EUR",
      "name": "name1",
      "rate_amount": "1.5",
      "credits_balance": "10",
      "balance": "10",
      "balance_cents": 1000,
      "consumed_credits": "2",
      "created_at": "2022-04-29T08:59:51Z",
      "expiration_date": null,
      "last_balance_sync_at": "2022-04-29T08:59:51Z",
      "last_consumed_credit_at": "2022-04-29T08:59:51Z",
      "ongoing_balance_cents": 800,
      "ongoing_usage_balance_cents": 200,
      "credits_ongoing_balance": "8.0",
      "credits_ongoing_usage_balance": "2.0",
      "recurring_transaction_rules": [
        {
          "lago_id": "12345",
          "trigger": "interval",
          "interval": "monthly",
          "paid_credits": "105.0",
          "granted_credits": "105.0"
        }
      ]
    },
    {
      "lago_id": "b7ab2926-1de8-4428-9bcd-779314ac1111",
      "lago_customer_id": "12345",
      "external_customer_id": "external-54321",
      "status": "active",
      "currency": "EUR",
      "name": "name2",
      "rate_amount": "1.5",
      "credits_balance": "10",
      "balance": "10",
      "balance_cents": 1000,
      "consumed_credits": "2",
      "created_at": "2022-04-29T08:59:51Z",
      "expiration_date": null,
      "last_balance_sync_at": "2022-04-29T08:59:51Z",
      "last_consumed_credit_at": "2022-04-29T08:59:51Z",
      "ongoing_balance_cents": 800,
      "ongoing_usage_balance_cents": 200,
      "credits_ongoing_balance": "8.0",
      "credits_ongoing_usage_balance": "2.0",
      "recurring_transaction_rules": []
    }
  ],
  "meta": {
    "current_page": 1,
    "next_page": 2,
    "prev_page": null,
    "total_pages": 8,
    "total_count": 73
  }
}
