tests/fixtures/wallet.json

{
  "wallet": {
    "lago_id": "b7ab2926-1de8-4428-9bcd-779314ac129b",
    "lago_customer_id": "12345",
    "external_customer_id": "external-12345",
    "status": "active",
    "currency": "EUR",
    "name": "name",
    "rate_amount": "1.5",
    "credits_balance": "10",
    "balance": "10",
    "balance_cents": 1000,
    "consumed_credits": "2",
    "created_at": "2022-04-29T08:59:51Z",
    "expiration_at": null,
    "last_balance_sync_at": "2022-04-29T08:59:51Z",
    "last_consumed_credit_at": "2022-04-29T08:59:51Z",
    "recurring_transaction_rules": [
      {
        "lago_id": "12345",
        "trigger": "interval",
        "interval": "monthly",
        "paid_credits": "105.0",
        "granted_credits": "105.0"
      }
    ],
    "ongoing_balance_cents": 800,
    "ongoing_usage_balance_cents": 200,
    "credits_ongoing_balance": "8.0",
    "credits_ongoing_usage_balance": "2.0"
  }
}
